#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_function_with_docker_build.data.aws_region.current: Reading...
data.aws_region.current: Reading...
module.docker_build.data.aws_region.current: Reading...
data.aws_ecr_authorization_token.token: Reading...
module.lambda_function_with_docker_build.data.aws_partition.current: Reading...
module.docker_build.data.aws_caller_identity.this: Reading...
module.lambda_function_with_docker_build.data.aws_caller_identity.current: Reading...
module.lambda_function_with_docker_build.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function_with_docker_build.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function_with_docker_build.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function_with_docker_build.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.docker_build.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.this: Reading...
module.docker_build.data.aws_caller_identity.this: Read complete after 0s [id=944523251195]
module.lambda_function_with_docker_build.data.aws_caller_identity.current: Read complete after 0s [id=944523251195]
data.aws_caller_identity.this: Read complete after 0s [id=944523251195]
data.aws_ecr_authorization_token.token: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.docker_build.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 2 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.docker_build.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "python-awslambda-template"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "project" = "python-awslambda-template"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.docker_build.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = (known after apply)
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2e799a20a68700b836304d3c0dd615d79a6e8516"
        }

      + build {
          + cache_from   = []
          + context      = "../"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + platform     = "linux/amd64"
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # module.docker_build.docker_registry_image.this will be created
  + resource "docker_registry_image" "this" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = false
      + name                 = (known after apply)
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha" = "2e799a20a68700b836304d3c0dd615d79a6e8516"
        }
    }

  # module.lambda_function_with_docker_build.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_function_with_docker_build.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/python-awslambda-template"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "project" = "python-awslambda-template"
        }
    }

  # module.lambda_function_with_docker_build.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "python-awslambda-template-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "project" = "python-awslambda-template"
        }
    }

  # module.lambda_function_with_docker_build.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "python-awslambda-template"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "project" = "python-awslambda-template"
        }
      + unique_id             = (known after apply)
    }

  # module.lambda_function_with_docker_build.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "python-awslambda-template"
    }

  # module.lambda_function_with_docker_build.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "My awesome lambda function with container image by modules/docker-build"
      + function_name                  = "python-awslambda-template"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "project" = "python-awslambda-template"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @xtutran, Action: `pull_request`*